app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rupali"], ["email", "roop4894@gmail.com"], ["birth_date", "2018-06-27"], ["created_at", "2018-06-27 06:19:27.050871"], ["updated_at", "2018-06-27 06:19:27.050871"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Rupali"], ["email", "roop4894@gmail.com"], ["updated_at", "2018-06-27 06:53:58.565349"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)